app/controllers/cats_controller.rb

  def create
    cat = Cat.new(cat_params)
    if cat.save
---
INSERT INTO "cats" ("name", "picture", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Opomuc"], ["picture", "0c375608c71811e1b10e123138105d6b_7.png"], ["created_at", 2017-04-18 14:45:47 UTC], ["updated_at", 2017-04-18 14:45:47 UTC]]

  def random
    cat = Cat.order("RANDOM()").last
---
SELECT  "cats".* FROM "cats" ORDER BY RANDOM() DESC LIMIT ?  [["LIMIT", 1]]